#+Title: Git Project Management Issues
#+Author: Your Name <your email>
#+PROPERTY: Effort_ALL  0:10 0:20 0:30 1:00 2:00 4:00 6:00 8:00
#+PROPERTY: ASSIGNEE
#+PROPERTY: REVIEWERS
#+PROPERTY: BRANCH
#+SEQ_TODO: FEEDBACK(f) TODO(t) STARTED(s) WAITING(w) LGTM(l) | DONE(d) CANCELLED(c) DEFERRED(f)
#+SEQ_TODO: REVIEW(r) | MERGED(m) ABORTED(a)
#+SEQ_TODO: ACCEPTED(l) CHANGE_REQUESTED(c) | REFUSED(r)
#+COLUMNS: %38ITEM(Details) %TAGS(Context) %7TODO(To Do) %8ASSIGNEE %5Effort(Time){:}
#+TAGS: bug(b) doc(d) ops(o)


This is an example on how to organize the issues. The basic usage is quite
simple, only use 3 status (todo, started, done)

The second section "Issues" show a more advanced usage which once you're used to
org-mode shouldn't be too hard to follow.
Mainly the idea is simply to add tags and properties.
You can use tags as github labels.
And think about properties to manages meta datas such as:

- Assignee (who is assignee to an issue)
- Reviewers (who is asked for review)
- branch (the branch asked for a review before merge)

*** ACCEPTED Advanced review workflow explained!
    :PROPERTIES:
    :REVIEWER: yogsototh
    :END:

A simple way to write and read review is to use ~org-capture~.
It will create a file with links to the file your are inspecting in emacs
without modifying the file.

A simple way to achieve this would be to create a reviews directory:
~mkdir ~/.reviews~

Then in the next section
Use =C-c C-c= to execute that and so you'll see all annotations.

Mainly the reviewer only need to use ~org-capture~ and put the result
in =reviews=.

#+NAME: init-reviews
#+BEGIN_SRC emacs-lisp :results silent
(require 'url)
(defun get-prop (prop-name)
  (org-with-point-at org-babel-current-src-block-location
    (org-entry-get nil prop-name t)))

(defun gen-review-file-name ()
  (let* ((branch (get-prop "BRANCH"))
         (reviewer (get-prop "REVIEWER"))
         (review-file-name ))
    (concat branch "-" reviewer ".org")))

(defun start-review ()
  "to be called at the beginning of the review"
  (let* ((review-file-name (gen-review-file-name))
         (review-dir "~/.reviews/")
         (local-review (concat "file:../reviews/" review-file-name))
         (global-review (concat review-dir review-file-name)))
    (url-copy-file local-review global-review)
    (setq org-default-notes-file global-review)))

(defun end-review ()
  "to be call when the reviewer ends its review."
  (let* ((review-file-name (gen-review-file-name))
         (review-dir "~/.reviews/")
         (local-review (concat "file:../reviews/" review-file-name))
         (global-review (concat review-dir review-file-name)))
    (url-copy-file global-review local-review)
    (setq org-default-notes-file global-review)))
#+END_SRC

1. Start by using =C-c C-c= here.
2. Switch to the issue branch.
3. If you just want to read the review open the =(gen-review-file-name)=
4. If you want to add a remark use =org-capture= to open the org file that will
   contain your remarks with a link to the line and file.
   I think to make it easier all member of the team should put their projects
   in the same place. Typically =~/dev/project-name=.


#+BEGIN_SRC elisp
(concat "[[~/.reviews/" (gen-review-file-name) "]]")
#+END_SRC

#+RESULTS:
: [[~/.reviews/write-contributing-yogsototh.org]]

#+BEGIN_SRC elisp :results silent
(start-review)
#+END_SRC

#+BEGIN_SRC elisp :results silent
(end-review)
#+END_SRC

